// Question: โค้ดด้านล่าง มีคำสั่ง alert อันไหนบ้างที่จะทำงาน
// ==================
if (-1 || 0) alert('first');
// Result: ทำงาน
// เนื่องจาก -1 มีค่า boolean เป็น true
// พอทำ || แล้วจะ return ค่า -1 เพราะเป็น true ตัวแรก กลับมาให้
// ทำให้เงื่อนไข if เป็นจริง คำสั่งที่อยู่ใต้ if จึงทำงาน

if (-1 && 0) alert('second');
// Result: ไม่ทำงาน
// เนื่องจาก 0 มีค่า boolean เป็น false
// พอทำ && แล้วจะ return ค่า 0 กลับมา เพราะเป็นค่า false ตัวแรก
// ทำให้เงื่อนไข if ไม่เป็นจริง คำสั่งที่อยู่ใต้ if จึงไม่ทำงาน

if (null || (-1 && 1)) alert('third');
// Result: ทำงาน
// เนื่องจาก (-1 && 1) มีการ return ค่าเป็น 1 ซึ่งมีค่า boolean เป็น true
// พอเอามาทำ || แล้วจะ return ค่าเพราะเป็น true กลับมาให้
// ทำให้เงื่อนไข if เป็นจริง คำสั่งที่อยู่ใต้ if จึงทำงาน


// Note:
// ===================
// Operation "||" จะ return ค่าที่เป็น True ตัวแรก
// Operation "&&" จะ return ค่าที่เป็น False ตัวแรก
// Operation "&&, ||" จะเช็คค่าไล่เรียงจากซ้ายไปขวา